package faq

import (
	"main/internal/model"
	"main/pkg/storage"
)

var Seed = []model.Faq{
	{
		Name:     "ტექნოლოგიური კომპანია",
		Slug:     "1",
		Question: "რა არის Ravenol და რა საქმე აკეთებს კომპანია?",
		Answer:   "Ravenol არის მნიშვნელოვანი ტექნოლოგიური კომპანია, რომელიც გთავაზობთ ამბავსა და მედიის გამოყენებას.",
	},
	{
		Name:     "პროდუქტები",
		Slug:     "2",
		Question: "Ravenol-ს პროდუქტები როგორ შეიძლება ვიყოთ მიმწოდებელი?",
		Answer:   "Ravenol-ს პროდუქტები შეიძლება შეიძლებონ ყველას, ვინც გსურს მოსაწყენებლად იყოს კურიერი ან მაღაზიაში.",
	},
	{
		Name:     "კონტაქტი",
		Slug:     "3",
		Question: "როგორ შემოგვედით კომპანიას Ravenol?",
		Answer:   "Ravenol-ს შესახებ შეგიძლიათ გამოგვიყენოთ ინტერნეტის გვერდი ან ჩვენი კონტაქტური ინფორმაცია.",
	},
	{
		Name:     "პროდუქტების განყოფილება",
		Slug:     "4",
		Question: "Ravenol-ს პროდუქტების განყოფილება როგორ ხდება?",
		Answer:   "Ravenol-ს პროდუქტები განაწილება ხდება ჩვენი ადგილებზე ან კლიენტის შერჩევით შესწორებული მეთოდით.",
	},
	{
		Name:     "კონტაქტი",
		Slug:     "5",
		Question: "თუ მოხდა შეცდომა ან მივიღეთ ანგარიშის დასაბრუნებლად სად უნდა მივიღოთ კონტაქტი?",
		Answer:   "შეცდომების დასაბრუნებლად და სხვა შეკითხვებისთვის შეგიძლიათ დაგვიკავშირდეთ ჩვენს გუნდს.",
	},
	{
		Name:     "ბაზა და დისტრიბუციული სისტემა",
		Slug:     "6",
		Question: "როგორ მუშაობს Ravenol-ს ბაზა და დისტრიბუციული სისტემა?",
		Answer:   "Ravenol-ს ბაზა და დისტრიბუციული სისტემა მუშაობს სწრაფად და ეფექტურად ჩვენი კლიენტების მისაღებად.",
	},
	{
		Name:     "უფლებები და წესები",
		Slug:     "7",
		Question: "Ravenol-ს მომხმარებელთა უფლებები და კომპანიის წესები.",
		Answer:   "ჩვენ ვყავით ჩვენს მომხმარებელთა უფლებებს და მივიღებთ მათი სურათების დაპასუხების უფლებებს.",
	},
	{
		Name:     "შეკვეთა",
		Slug:     "8",
		Question: "როგორ შევიყვანოთ შეკვეთა Ravenol-ს პროდუქტებზე?",
		Answer:   "შეკვეთა შესაძლებელია ჩვენი ვებგვერდის საშუალებით ან მაღაზიაში.",
	},
	{
		Name:     "ვებგვერდი",
		Slug:     "9",
		Question: "Ravenol-ს საკუთარი საიტის ფუნქციონალის შესახებ.",
		Answer:   "ჩვენი ვებგვერდი შეიცავს ჩვენს პროდუქტებსა და სხვა ინფორმაციას.",
	},
	{
		Name:     "ინფორმაცია",
		Slug:     "10",
		Question: "სხვა ინფორმაცია და დასახელება შესაბამისი Ravenol-ს კომპანიის შესახებ.",
		Answer:   "თუ გსურთ მეტი ინფორმაცია Ravenol-ს შესახებ, გთხოვთ, მოგვწერეთ და გადაგიხდეთ ჩვენს გუნდს.",
	},
}

func Populate() {
	for _, row := range Seed { storage.DB.Create(&row) }
}
